#+TITLE: Guile CPS Debugger - Interactive Demo
#+PROPERTY: header-args:scheme :session *guile-cps*
#+STARTUP: showeverything

** Basic CPS Example Functions

#+BEGIN_SRC scheme :results output
;; Define a simple CPS factorial
(define (factorial-cps n k)
  (if (= n 0)
      (k 1)
      (factorial-cps (- n 1)
                     (lambda (result)
                       (k (* n result))))))

;; Identity continuation
(define (identity x) x)

(display "CPS factorial defined\n")
#+END_SRC

#+RESULTS:
: CPS factorial defined

** Tracing Function Execution

#+BEGIN_SRC scheme :results output
;; Use Guile's built-in tracing
(use-modules (system vm trace))

;; Trace the function execution
(call-with-trace 
  (lambda ()
    (factorial-cps 3 identity))
  #:max-indent 10)
#+END_SRC

#+RESULTS:
: trace: |  (factorial-cps 3 #<procedure identity (x)>)
: trace: |  (factorial-cps 2 #<procedure 84a9aa2a0 at <unknown port>:33:21 (re…>)
: trace: |  (factorial-cps 1 #<procedure 84ab576a0 at <unknown port>:33:21 (re…>)
: trace: |  (factorial-cps 0 #<procedure 84155bd40 at <unknown port>:33:21 (re…>)
: trace: |  (_ 1)
: trace: |  (_ 1)
: trace: |  (_ 2)
: trace: |  (identity 6)
: trace: |  6

** Setting Breakpoints

#+BEGIN_SRC scheme :results output
;; Add trap at procedure call
(define trap-id 
  (add-trap-at-procedure-call! 
    factorial-cps
    (lambda (frame)
      (format #t "=== Breakpoint Hit ===\n")
      (format #t "Frame: ~a\n" frame)
      (format #t "Arguments: ~a\n" (frame-arguments frame))
      #f))) ; Return #f to continue

;; Test the trap
(factorial-cps 2 identity)

;; Remove trap
(delete-trap! trap-id)
#+END_SRC

#+RESULTS:
: ice-9/boot-9.scm:1676:22: In procedure raise-exception:
: Unbound variable: add-trap-at-procedure-call!
: 
: Entering a new prompt.  Type `,bt' for a backtrace or `,q' to continue.
: scheme@(guile-user) [1]> 

** Inspecting Stack Frames

#+BEGIN_SRC scheme :results output
;; Create a function that inspects its own stack
(define (inspect-my-stack n)
  (define (helper depth k)
    (if (= depth 0)
        (begin
          ;; Capture and inspect current stack
          (let ((stack (make-stack #t)))
            (format #t "Stack depth: ~a\n" (stack-length stack))
            (do ((i 0 (+ i 1)))
                ((>= i (min 5 (stack-length stack))))
              (let ((frame (stack-ref stack i)))
                (format #t "Frame ~a: ~a\n" 
                        i (frame-procedure-name frame)))))
          (k 'done))
        (helper (- depth 1) 
                (lambda (x) (k x)))))
  (helper n identity))

(inspect-my-stack 3)
#+END_SRC

#+RESULTS:
: Stack depth: 49
: Frame 0: make-stack
: Frame 1: inspect-my-stack
: Frame 2: eval
: Frame 3: #f
: Frame 4: %start-stack

** Memory and Continuation Analysis

#+BEGIN_SRC scheme :results output
;; Analyze continuation memory usage
(define (analyze-continuation-chain depth)
  (define closures '())
  
  (define (build-chain n k)
    (if (= n 0)
        (begin
          (k 'end)
          closures)
        (let ((current-k k))
          (set! closures (cons k closures))
          (build-chain (- n 1)
                       (lambda (x)
                         (k (cons n x)))))))
  
  ;; Build chain and analyze
  (gc) ; Clean before measurement
  (let ((before (gc-stats)))
    (build-chain depth identity)
    (gc)
    (let ((after (gc-stats)))
      (format #t "Chain depth: ~a\n" depth)
      (format #t "Closures created: ~a\n" (length closures))
      (format #t "Heap growth: ~a bytes\n"
              (- (assoc-ref after 'heap-size)
                 (assoc-ref before 'heap-size))))))

(analyze-continuation-chain 10)
#+END_SRC

#+RESULTS:
: Chain depth: 10
: Closures created: 10
: Heap growth: 0 bytes

** Profiling CPS Execution

#+BEGIN_SRC scheme :results output
;; Profile CPS vs direct style
(use-modules (statprof))

;; Direct style factorial
(define (factorial-direct n)
  (if (= n 0)
      1
      (* n (factorial-direct (- n 1)))))

;; Profile both versions
(format #t "=== Profiling Direct Style ===\n")
(statprof 
  (lambda ()
    (do ((i 0 (+ i 1)))
        ((= i 1000))
      (factorial-direct 10))))

(format #t "\n=== Profiling CPS Style ===\n")
(statprof
  (lambda ()
    (do ((i 0 (+ i 1)))
        ((= i 1000))
      (factorial-cps 10 identity))))
#+END_SRC

#+RESULTS:
: === Profiling Direct Style ===
: No samples recorded.
: 
: === Profiling CPS Style ===
: No samples recorded.

